In [2]:
import pandas as pd

In [3]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])

# 데이터프레임 출력
print(df)
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [4]:
temp = df.copy()
temp.index = [0,1,2]
temp.loc[:2]

   수학  영어   음악   체육
0  90  98   85  100
1  80  89   95   90
2  70  95  100   90

In [5]:
temp = df.copy()
temp.index = [0,1,2]
temp.iloc[:2]

   수학  영어  음악   체육
0  90  98  85  100
1  80  89  95   90

In [ ]:
# 행 인덱스를 사용하여 행 1개를 선택
#iloc와 loc의 차이는?
label1 = df.loc['서준']    # loc 인덱서 활용, 즉 '서준' 그 값 그 잡채
position1 = df.iloc[0]     # iloc 인덱서 활용, 즉 몇번쨰
print(label1)
print('\n')
print(position1)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64


수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [ ]:
# 행 인덱스를 사용하여 2개 이상의 행 선택
label2 = df.loc[['서준', '우현']]   #서준, 우현 그 값 그잡채
position2 = df.iloc[[0, 1]]         #첫번째 두번째
print(label2)
print('\n')
print(position2)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90


    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [ ]:
# 행 인덱스의 범위를 지정하여 행 선택
label3 = df.loc['서준':'우현']      #서준부터 우현까지 
position3 = df.iloc[0:1]            #0번부터 1번전까지, 즉 0번째 것만 출력
print(label3)
print('\n')
print(position3)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90


    수학  영어  음악   체육
서준  90  98  85  100